#### DoorEvacuationExitType Enumeration

---

|  |
| --- |
| See Also |

An enumerated type listing the possible door evacuation types

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 21.0.0.0 (21.1.1.109)

# Syntax

| C# |
| --- |
| ``` public enum DoorEvacuationExitType ``` |

| Visual Basic |
| --- |
| ``` Public Enumeration DoorEvacuationExitType ``` |

| Visual C++ |
| --- |
| ``` public enum class DoorEvacuationExitType ``` |

# Members

| Member name | Description |
| --- | --- |
| ExteriorExit | Exterior exit door. |
| InteriorExit | Interior exit door. |
| InteriorPassage | Interior passage door. |
| None | Not used for exit access. |

# See Also

Autodesk.Revit.DB Namespace